<html>
<head>
<title>KOSY-Hilfe/Men&uuml; Datei</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body bgcolor="#FFFFFF" text="#000000">
<p><font face="Times New Roman" size="6" color="#FF00FF"><b><i>Men&uuml; Datei<br>
  </i><font face="Tahoma" size="1" color="#000000">Überarbeitet: Oktober 2004</font></b></font></p>
<p><font face="Tahoma" size="2" color="#000000">Am Anfang jeder Programmier-T&auml;tigkeit 
  mit <i><b>nccad</b></i> steht die Auswahl einer Datei, die bearbeitet werden 
  soll. Entweder es wird eine neue Datei begonnen, oder eine vorhandene zur Weiterbearbeitung 
  aufgerufen. Au&szlig;erdem werden &uuml;ber dieses Men&uuml; die Funktionen 
  &quot;<b>Speichern</b>&quot; und &quot;<b>Drucken</b>&quot; gestartet. Der ordnungsgem&auml;&szlig;e 
  Ausstieg aus <i><b>nccad</b></i> wird ebenfalls &uuml;ber dieses Men&uuml; erreicht. 
  </font></p>
<p><font face="Tahoma" size="2" color="#000000">Grunds&auml;tzlich wird im Men&uuml; 
  Datei die Entscheidung getroffen, ob die Programmierung der CNC-Maschine nach 
  der CNC-Methode oder nach der CAD/CAM-Methode erfolgen soll.</font></p>
<p><img src="Bilder/Menue_Datei.gif" width="278" height="439"></p>
<p align="left"><font face="Tahoma" size="2" color="#000000">Im Einzelnen ist 
  Folgendes zu beachten:</font></p>
<menu> 
<li><font face="Tahoma" size="2" color="#000000"><b>CAD/CAM - Neue Zeichnung</b><br>
  Der Weg von der Zeichnung zum Werkst&uuml;ck beginnt hier.<br>
  F&uuml;r den Fall, da&szlig; eine Datei bereits in Arbeit ist, wird zun&auml;chst 
  gefragt, ob sie abgespeichert werden soll. Danach wird der Bildschirm erneuert 
  und ein leeres Zeichenfeld in Form des Y-Tisches dargestellt. Gleichzeitig wird 
  der Speicher f&uuml;r die Zeichnungsteile gel&ouml;scht. Die eigentlichen Zeichenfunktionen 
  w&auml;hlen Sie &uuml;ber die Iconleiste.</font> </li>
<li> 
  <p align="left"><font face="Tahoma" size="2" color="#000000"><b>CAD/CAM - Neue 
    Spezialzeichnung</b> </font><br>
    <font face="Tahoma" size="2">Hier sind die nicht allt&auml;glichen CAD-Funktionen 
    zusammengefa&szlig;t. Es erscheint ein weiteres Untermen&uuml;, in dem gew&auml;hlt 
    werden mu&szlig;. </font> 
  <ul>
    <li><font face="Tahoma" size="2" color="#000000"><b>Drehen</b><br>
      Wenn Sie &uuml;ber den Drehzusatz verf&uuml;gen, werden die Software-Funktionen 
      zug&auml;nglich.<br>
      Die Bedienung wird im zugeh&ouml;rigen Handbuch bzw. im Hilfethema erl&auml;utert.<br>
      </font></li>
    <li><font face="Tahoma" size="2" color="#000000"><b>Modellbau</b><br>
      Speziell Modellbauer k&ouml;nnen mit den zugeh&ouml;rigen Funktionen Rippenk&ouml;rper 
      konstruieren (Fl&uuml;gel, R&uuml;mpfe u.A.m.)<br>
      Die Bedienung wird im Hilfethema <a href="../../Grundlagen_Fraesmaschine/3D%20Anwendungen/CAD_3D_Modellbau.htm">3D/Modellbau</a> 
      erl&auml;utert.</font></li>
  </ul>
</li>
<li><font face="Tahoma" size="2" color="#000000"><b>CAD/CAM - Zeichnung &ouml;ffnen</b><br>
  Eine vorhandene Zeichnung soll geladen werden. F&uuml;r den Fall, da&szlig; 
  eine Datei bereits in Arbeit ist, wird zun&auml;chst gefragt, ob sie abgespeichert 
  werden soll. Danach wird der Bildschirm erneuert und ein Auswahlfenster mit 
  den, im angemeldeten Verzeichnis vorhandenen, CAD-Dateien ge&ouml;ffnet. W&auml;hlen 
  Sie die gew&uuml;nschte Datei. <br>
  </font></li>
<li><font face="Tahoma" size="2" color="#000000"><b>CNC - Neues Programm</b><br>
  Ein neues NC-Programm soll begonnen werden. F&uuml;r den Fall, da&szlig; eine 
  Datei bereits in Arbeit ist, wird zun&auml;chst gefragt, ob sie abgespeichert 
  werden soll. Danach wird der Bildschirm erneuert und ein leeres Editierfeld 
  dargestellt. Gleichzeitig wird der Speicher f&uuml;r die NC-S&auml;tze gel&ouml;scht.</font> 
  <font face="Tahoma" size="2" color="#000000"><br>
  </font></li>
<li><font face="Tahoma" size="2" color="#000000"><b>CNC - Programm &ouml;ffnen</b><br>
  &Uuml;ber das Explorer-Fenster wird eine KOSY-CNC-Datei mit der Extension <font face="Courier New, Courier, mono">*.KNC 
  </font>ausgew&auml;hlt und geladen. Gleichzeitig wird der Texteditor ge&ouml;ffnet.<br>
  Ein vorhandenes NC-Programm soll geladen werden. F&uuml;r den Fall, da&szlig; 
  eine Datei bereits in Arbeit ist, wird zun&auml;chst gefragt, ob sie abgespeichert 
  werden soll. Danach wird der Bildschirm erneuert und ein Auswahlfenster mit 
  den, im angemeldeten Verzeichnis vorhandenen, CNC-Programmen ge&ouml;ffnet. 
  W&auml;hlen Sie die gew&uuml;nschte Datei aus. </font></li>
<li><font face="Tahoma" size="2" color="#000000"><b>Datei importieren<br>
  </b></font><font face="Tahoma" size="2">Hier sind die nicht allt&auml;glichen 
  Lade-Funktionen zusammengefa&szlig;t. Es erscheint ein weiteres Untermen&uuml;, 
  in dem gew&auml;hlt werden mu&szlig;.</font> 
  <ul>
    <li><font face="Tahoma" size="2" color="#000000"><b>DXF</b><br>
      Sind Zeichnungen mit anderen CAD Programmen erstellt- und als DXF-Dateien 
      abgespeichert worden, k&ouml;nnen sie hier eingelesen werden. <br>
      Die Erg&auml;nzung mit Technologiedaten wird dann in <i><b>nccad</b></i> 
      vorgenommen. <br>
      Fremde Zeichnungen werden von Layer 0 bis 32000 erfa&szlig;t, Layer 0 wird 
      auf Layer 1 umgesetzt und Layer gr&ouml;&szlig;er 9 erscheinen in den Layern 
      1 bis 9. Farben werden beim Import nur im Zusammenhang mit Punkten ausgewertet. 
      Zu gro&szlig;e Zeichnungen werden beim Import automatisch mit einem ganzzahligen 
      Ma&szlig;stabsfaktor auf Tischma&szlig; verkleinert. Bei zu kleinen Zeichnungen 
      wird die Frage gestellt, ob der Ma&szlig;stab angepa&szlig;t werden soll 
      oder nicht, erst dann wird eingelesen und dabei entweder die Zeichnung belassen 
      oder auf Tischma&szlig;e vergr&ouml;&szlig;ert. Die Abarbeitung der im Ma&szlig;stab 
      ver&auml;nderten Zeichnungen mit Grafiksimulation oder mit der CNC-Maschine 
      erfolgt allerdings in Orginalgr&ouml;&szlig;e, wenn Sie nicht im Men&uuml; 
      &lt;Parameter&gt; einen neuen Ma&szlig;stabswert angeben.</font>&nbsp;<font size="2" face="Tahoma"> 
      Siehe auch unter <a href="../../ImportExport/ImpExp_2Dimport.htm">Import/Export 
      2D</a> .</font></li>
    <li><font face="Tahoma" size="2" color="#000000"><b>HPGL</b><br>
      Manche CAD-Programme liefern sog. Plotter-Dateien (HPGL-Dateien). Wenn die 
      CNC-Maschine den Plotter ersetzen soll, ist diese Importm&ouml;glichkeit 
      von Vorteil.<br>
      Die Technologie-Angaben von <i><b>nccad</b></i> bieten zudem die M&ouml;glichkeit 
      der Bahnkorrektur und Mehrfach-Zustellung.<br>
      </font><font size="2" face="Tahoma">Siehe auch unter <a href="../../ImportExport/ImpExp_2Dimport.htm">Import/Export 
      2D</a> .</font><font face="Tahoma" size="2" color="#000000"> <br>
      </font></li>
    <li><font face="Tahoma" size="2" color="#000000"><b>Oberfl&auml;chen-Datei</b><br>
      Wurde zuvor ein <a href="../../Optionen%20Anwendung/Abtasten.htm">plastischer 
      K&ouml;rper abgetastet</a> und das Ergebnis abgespeichert (<font face="Courier New, Courier, mono">*.txt</font>), 
      kann es &uuml;ber diese Funktion wieder geladen werden. Auf der Zeichenfl&auml;che 
      erscheint dann eine Plastische Zone.</font></li>
    <li><font face="Tahoma" size="2" color="#000000"><b>STL-Datei</b><br>
      Werden 3D-K&ouml;rper mit fremder CAD gezeichnet und als STL-Datei abgespeichert 
      (<font face="Courier New, Courier, mono">*.stl</font>), dann k&ouml;nnen 
      sie hier importiert werden. Alles Weitere siehe unter Hilfethemen <a href="../../Grundlagen_Fraesmaschine/3D%20Anwendungen/CAD_3D_STL.htm">CAD 
      3D/STL</a>.</font></li>
    <li><font face="Tahoma" size="2" color="#000000"><b>Bild-Datei</b><br>
      Hier k&ouml;nne Bild-Dateien in den Formaten BMP, GIF und JPG importiert 
      werden. Mehr dazu erfahren Sie unter <a href="../../Grundlagen_CAD/Grafik/BilderImport.htm">Grundlagen 
      CAD/Grafik.....</a>.</font></li>
  </ul>
</li>
<li><font face="Tahoma" size="2" color="#000000"><b>Letzte Datei(en)</b><br>
  Sie erhalten eine Auflistung der letzten, von Ihnen bearbeiteten, Dateien, f&uuml;r 
  einen schnellen Zugriff.</font></li>
<li><font face="Tahoma" size="2" color="#000000"><b>Datei speichern</b><br>
  Die gerade in Arbeit befindliche Datei wird im angemeldeten Verzeichnis gespeichert. 
  Sollte noch kein Name angegeben worden sein (in der Men&uuml;zeile oben steht 
  unter Dateiname &quot;KeinName&quot; ) wird zun&auml;chst das Datum und der 
  Name des Bearbeiters gefordert. Erst danach wird das Explorer-Fenster f&uuml;r 
  die Eingabe des Dateinamens ge&ouml;ffnet.<br>
  </font></li>
<li><font face="Tahoma" size="2" color="#000000"><b>Datei speichern unter</b><br>
  Es wird ein Fenster ge&ouml;ffnet, in dem Datum und Name des Bearbeiters einzugeben 
  sind. Erst danach wird das Explorer-Fenster f&uuml;r die Eingabe des Dateinamens 
  ge&ouml;ffnet.<br>
  Auf diese Weise lassen sich vorhandene Dateien unter neuem Namen abspeichern, 
  wenn sie z.B. abge&auml;ndert wurden. Die Datei wird unter dem angegebenen Namen 
  im angemeldeten Verzeichnis abgespeichert. Das Verzeichnis kann aber auch ver&auml;ndert 
  werden. </font> </li>
<li><font face="Tahoma" size="2" color="#000000"><b>Datei exportieren</b><br>
  Hier sind die nicht allt&auml;glichen Speicher Funktionen zusammengefa&szlig;t. 
  Es erscheint ein weiteres Untermen&uuml;, in dem gew&auml;hlt werden mu&szlig;.</font> 
</li>
<ul>
  <li><font face="Tahoma" size="2" color="#000000"><b>Modellbau (3D -&gt;2D)</b><br>
    Sind f&uuml;r Rippenkonstruktionen unter &quot;3D/Modellbau&quot; mehrere 
    Rippenprofile entstanden, werden sie durch diesen Export-Aufruf auf eine Fl&auml;che 
    projeziert und k&ouml;nnen als 2D Datei weiter bearbeitet werden (z.B. Verteilen, 
    mit Technologie versorgen und Ausfr&auml;sen).<br>
    </font></li>
  <li><font face="Tahoma" size="2" color="#000000"><b>HPGL Datei</b><br>
    Die Zeichnung wird als Plott-Datei (<font face="Courier New, Courier, mono">*.PLT</font>) 
    abgespeichert.<br>
    Sie kann dann entweder einem Plotter zugef&uuml;hrt werden oder in ein DTP-Programm 
    importiert werden.Wenn Sie Zeichnungen zum HPGL-Export machen, sollten Sie 
    keine True-Type-Schriften einbinden (Beschriftung, Gravurtexte), sie k&ouml;nnen 
    nicht dargestellt- oder ausgeplottet werden. <br>
    </font></li>
  <li><font face="Tahoma" size="2" color="#000000"><b>KOSY Liste</b><br>
    Wurde eine Zeichnung mit Technologiedaten erstellt, dann wird &uuml;blicherweise 
    im Men&uuml; &lt;Maschine&gt; ein Bearbeitungsablauf gestartet , oder die 
    Grafik-Simulation aufgerufen. In jedem Fall wird zun&auml;chst der Postprozessor 
    aktiviert, der eine Steuerliste f&uuml;r die CNC-Maschine erzeugt. Diese Steuerliste 
    kann separat abgespeichert werden, sie hat denselben Namen wie die Zeichnungs-Datei, 
    jedoch die Erweiterung <font face="Courier New, Courier, mono">*.CNC</font>. 
    <br>
    </font></li>
</ul>
<li><font face="Tahoma" size="2" color="#000000"><b>Seite einrichten</b><br>
  Alle Vorbereitungen zum Drucken werden hier getroffen. Das zugeh&ouml;rige Fenster 
  ist sehr &uuml;bersichtlich und erkl&auml;rt sich selbst. Weitere Hinweise finden 
  Sie unter <a href="../../Bedienung/Drucken%20von%20Handbuch%20und%20Dateien.htm">Grundlagen 
  der Bedienung/Drucken...</a></font></li>
<li><font face="Tahoma" size="2" color="#000000"><b>Datei drucken</b><br>
  Die aktuelle Datei wird ausgedruckt.<br>
  Die Druckereinstellung finden Sie &quot;Seite einrichten&quot; (siehe oben).</font></li>
<li><font face="Tahoma" size="2" color="#000000"><b>Konfiguration</b><br>
  Hierzu finden Sie ausf&uuml;hrliche Informationen unter <a href="../../Bedienung/Konfigurierung.htm">Grundlagen 
  der Bedienung/Konfiguration</a>....</font></li>
<li><font face="Tahoma" size="2" color="#000000"><b>Vorlagen</b><br>
  Hierzu finden Sie ausf&uuml;hrliche Informationen unter <a href="../../Bedienung/Vorlagen.htm">Grundlagen 
  der Bedienung/Vorlagen</a>.... <br>
  </font></li>
<li><font face="Tahoma" size="2" color="#000000"><b>nccad6 Ende</b><br>
  Der ordnungsgem&auml;&szlig;e Ausstieg aus <i><b>nccad</b></i> &uuml;ber diese 
  Men&uuml;-Funktion ist immer zu empfehlen, es werden alle Einstellungen abgespeichert. 
  </font></li>
</menu>
<p>&nbsp;</p>
</body>
</html>
