<html>

<head>
<meta http-equiv="Content-Language" content="de">
<meta http-equiv="Content-Type" content="text/html; charset=windows-1252">
<meta name="GENERATOR" content="Microsoft FrontPage 4.0">
<meta name="ProgId" content="FrontPage.Editor.Document">
<title>KOSY-Hilfe/Optionen/Schubdosierung</title>
</head>

<body>
<p>&nbsp;</p>
<table width="83%" border="0">
  <tr>
    <td width="46%"><img src="Bilder/Schubdos_GesamtA3Std.jpg" width="300" height="256"></td>
    <td width="54%" valign="baseline"> 
      <p><i><b><font color="#FF00FF" face="Times New Roman" size="5">Dosiersystem 
        <br>
        mit Schubdosierung <br>
        <br>
        </font></b></i><font face="Tahoma" size="2" color="#000000"><b> <b>Stand: 
        18. M&auml;rz 2003 , vorl&auml;ufige Version</b></b></font></p>
      <p align="left"><font face="Arial" size="2" color="#808080"><b>Bild 1: </b>Das 
        spezielle Dosiersystem. Die Einheit f&uuml;r die Schubdosierung wurde 
        hier an einer CNC-Maschine A4 Standard montiert.</font></p>
      </td>
  </tr>
</table>
<p align="left">&nbsp;</p>
<p><font face="Tahoma" size="2"> </font><font face="Tahoma" size="2"><br>
  </font> <font face="Tahoma"> <b><font color="#FF00FF" size="4">1. </font> <font color="#FF00FF" size="2"> 
  Das System</font></b><font size="2"><br>
  Ein 2-Komponentenkleber mu&szlig; in die Klebekan&auml;le von verschiedenen 
  Geh&auml;useteilen dosiert werden. Dazu wurde ein System aufgebaut, das aus 
  folgenden Komponenten besteht:</font></font></p>
<ul>
  <li><font face="Tahoma" size="2">Einer CNC-Maschine </font></li>
  <li><font face="Tahoma" size="2">Einer Schubdosier-Einheit, am Z-Tisch montiert</font></li>
  <li><font face="Tahoma" size="2">Diversen Halterungen f&uuml;r die verschiedenen 
    Geh&auml;useteile</font></li>
  <li><font face="Tahoma" size="2">Der CAD/CAM-Software <i><b>nccad</b></i> in 
    der Version mit &quot;Schubdosierung&quot;</font></li>
  <li><font face="Tahoma" size="2">Auf besondere Bestellung: Den diversen Ablaufprogrammen 
    f&uuml;r die Werkst&uuml;cke</font></li>
  <li><font face="Tahoma" size="2">Dem PC, vom Kunden gestellt</font></li>
</ul>
<p><font face="Tahoma" size="2">Nur das Zusammenspiel von Mechanik, Steuerelektronik 
  und Software erm&ouml;glicht die L&ouml;sung der gestelltren Aufgabe.</font></p>
<p><font face="Tahoma" size="2" color="#FF00FF"><b>1.1 Die Schubdosierung</b></font><font face="Tahoma" size="2"><br>
  Dies ist die wichtigste Komponente im System. Es handelt sich um eine Neuentwicklung 
  von MAXcomputer, die sehr universell f&uuml;r Dosieraufgaben geeignet ist und 
  ohne Druckluft auskommt. Die folgenden Bilder zeigen die Konstruktion.</font></p>
<table width="90%" border="0">
  <tr>
    <td width="32%"><img src="Bilder/Schubdos_Antrieb.jpg" width="200" height="293"></td>
    <td width="68%" valign="baseline"> <p align="left"><font face="Arial" size="2" color="#808080"><b><i>Bild 
        2:</i></b><i> </i>Den Antrieb f&uuml;r die Schubstangen &uuml;bernimmt 
        ein Schrittmotor, dessen Steuerung von der Software unmittelbar unterst&uuml;tzt 
        wird. <br>
        Die F&uuml;hrung ist sehr sabil, um die gro&szlig;en Kr&auml;fte aufnehmen 
        zu k&ouml;nnen. Der F&uuml;hrungsschlitten wird &uuml;ber eine Spindel 
        bewegt, oben links sehen Sie den Endschalter f&uuml;r die Endposition. 
        <br>
        Zur Anpassung der Schubkraft gibt es 2 M&ouml;glichkeiten:</font></p>
      <ul>
        <li><font color="#808080" size="2" face="Arial" align="left">Im Getriebekasten 
          befindet sich eine Zahnriemen-Untersetzung.</font></li>
        <li><font color="#808080" size="2" face="Arial" align="left">In die Elektronik 
          sind 2 Potis eingebaut, mit deren Hilfe der Strangstrom- und damit die 
          Kraft des Schrittmotors eingestellt werden kann.</font></li>
      </ul>
      <p align="left"><font face="Arial" size="2" color="#808080">.<br>
        Die Kartuschen-Aufnahme kann sehr leicht gel&ouml;st- und abgezogen werden. 
        Dazu m&uuml;ssen vorher logischerweise die Schubstangen ganz nach oben 
        gefahren werden.</font></p></td>
  </tr>
  <tr>
    <td width="32%"><img src="Bilder/Schubdos_Mischrohr.jpg" width="200" height="356"></td>
    <td width="68%" valign="baseline"> 
      <p align="left"><font face="Arial" size="2" color="#808080"><b><i>Bild 3: 
        </i></b></font><font face="Arial" size="2" color="#808080">Der Kleber 
        befindet sich in einer Doppelkartusche, die aus zwei Kammern - entsprechend 
        dem Mischungsverh&auml;ltnis - besteht. <br>
        &Uuml;ber 2 Schubstangen werden 2 Stopfen in die Katuschenkammern gedr&uuml;ckt 
        und dabei die beiden Kleberkomponenten in ein Mischrohr gepresst. Doch 
        hier ist Vorsicht geboten: Ein zu schneller Vorschub der Schubstangen 
        bei dickfl&uuml;ssigem Dosiergut und bei d&uuml;nner Dosiernadel erh&ouml;ht 
        den Innendruck- Die Kartusche kann platzen.<br>
        Am Ende des Mischrohres befindet sich ein LuerLock-Adapter und eine Dosiernadel, 
        &uuml;ber deren Durchmesser die Auftragsbreite bestimmt wird.</font></p>
      </td>
  </tr>
</table>
<p>&nbsp;</p>
<p><font face="Tahoma"><b><font color="#FF00FF" size="4">2. </font> <font color="#FF00FF" size="2"> 
  Inbetriebnahme und Test</font></b><font size="2"><br>
  Voraussetzung f&uuml;r den Einsatz und die Programmierung des Dosiersystems 
  sind die grundlegenden Kenntnisse &uuml;ber das Koordinatentisch-System KOSY. 
  Der Hersteller, MAXcomputer, hilft hier auf eine der folgenden Weisen:</font></font></p>
<ul>
  <li><font face="Tahoma" size="2">Durch die <b>Einarbeitungs-Schulung</b>, bei 
    der die Grundlagen von Bedienung und Programmierung trainiert werden.</font></li>
  <li><font face="Tahoma" size="2">Durch den <b>gemeinsamen Test und die Inbetriebnahme</b> 
    der Dosierung bei der &Uuml;bergabe.</font></li>
  <li><font face="Tahoma" size="2">Durch diese <b>Anleitung zur Schubdosierung</b> 
    und durch das <b>Hilfesystem</b> innerhalb der Software <i><b>nccad</b></i>. 
    Insbesonders durch die Hilfethemen:<br>
    - Grundlagen/CNC-Programmierung<br>
    - Grundlagen/Handsteuerung der CNC-Maschine</font></li>
</ul>
<p><font face="Tahoma" size="2">Die nachfolgenden Schritte sollen alle T&auml;tigkeiten 
  der Inbetriebnahme bis zur funktionierenden Dosierung nochmals zusammenfassen:</font></p>
<p><font face="Tahoma" size="2" color="#FF00FF"><b>2.1 Erst-Inbetriebnahme der 
  CNC-Maschine ohne Kartusche</b></font><font face="Tahoma" size="2"><br>
  Zun&auml;chst sind folgende Voraussetzung zu erf&uuml;llen: Der PC mu&szlig; 
  eingeschaltet- und das Programm <i><b>nccad</b></i> gestartet sein, die Verbindung 
  zur CNC-Maschine &uuml;ber die serielle Schnittstelle mu&szlig; vorhanden sein 
  und die CNC-Maschine mu&szlig; eingeschaltet sein. Das Statuspanel an der CNC-Maschine 
  mu&szlig; &quot;frei&quot; anzeigen. Danach sind die folgenden T&auml;tigkeiten 
  auszuf&uuml;hren:</font></p>
<ol>
  <li><font face="Tahoma" size="2">Innerhalb der Software <i><b>nccad</b></i> 
    w&auml;hlen Sie <b>Maschine/CNC-Maschine</b>. Das Fenster Handsteuerung erscheint.</font></li>
  <li><font face="Tahoma" size="2">Dr&uuml;cken Sie die Taste<b> [Pos 1]</b>, 
    die 3 Tische des Koordinatentisch-Systems laufen an die Endschalter. Man nennt 
    dies einen <b>Referenzlauf</b>.</font></li>
  <li><font face="Tahoma" size="2">Dr&uuml;cken Sie die Taste <b>[Entf]</b>, der 
    Y-Tisch kommt Ihnen ganz entgegen, dies ist die <b>Ausspannposition</b>.</font></li>
  <li><font face="Tahoma" size="2">Spannen Sie ihr Werkst&uuml;ck ein.</font></li>
  <li><font face="Tahoma" size="2">Montieren Sie eine provisorische <b>Tastspitze</b> 
    an der unteren Halterung f&uuml;r das Mischrohr ein.</font></li>
  <li><font face="Tahoma" size="2">Fahren Sie mithilfe der<b> Cursortasten</b> 
    die Tastspitze an eine markierte Stelle <b>&quot;Nullpunkt&quot;</b> auf dem 
    Werkst&uuml;ck.</font></li>
  <li><font face="Tahoma" size="2">Dr&uuml;cken Sie die Tastenkombination <b>[Strg] 
    + [Ende]</b>, die Anzeige der Koordinaten (gr&uuml;ne Felder) mu&szlig; auf 
    <b>Null</b> gehen. Versichern Sie sich noch, da&szlig; der Werkst&uuml;ck-Nullpunkt 
    <b>(WNP) Nr. 1</b> angew&auml;hlt ist.</font></li>
  <li><font face="Tahoma" size="2">Geben Sie zur Kontrolle beispielsweise den 
    <b>CNC-Befehl</b> </font><font face="Tahoma"> <font color="#339966" size="2" face="Courier New, Courier, mono">G00 
    X50 Y70 Z5</font></font><font face="Tahoma" size="2"> und [Return] ein, die 
    Achsen m&uuml;ssen sich an die entsprechende Position bewegen.</font></li>
</ol>
<p><font face="Tahoma" size="2">Damit ist der Test abgeschlossen.</font></p>
<p><font face="Tahoma" size="2" color="#FF00FF"><b>2.2 Test der Schubdosierung</b></font><font face="Tahoma" size="2"><br>
  F&uuml;r Sie wurden besondere Befehle und Bedienelemente geschaffen. Zuvor stellen 
  Sie im Men&uuml; <b>Parameter/Maschine/KOSY</b> folgede Bedingungen ein:</font></p>
<ul>
  <li><font face="Tahoma" size="2">Im Feld <b>Optionen</b> die Schaltfl&auml;che 
    U-Achse aktiv.</font></li>
  <li><font face="Tahoma" size="2">Im Feld <b>Optionen U-Achse</b> Schubstangendosierung 
    aktiv.</font></li>
</ul>
<p><font face="Tahoma" size="2">Pr&uuml;fen Sie, ob das <b>Anschlu&szlig;kabel</b> 
  f&uuml;r die Schubdosierung sowohl ganz oben am Aufbau- als auch hinten an der 
  CNC-Maschine <b>angeschlossen</b> ist. Unter 1.1 und mit den Bildern 2 und 3 
  (siehe oben) wird Ihnen die Konstruktion erkl&auml;rt, deren Verst&auml;ndnis 
  ist wichtig f&uuml;r den folgenden Test und die Nutzung.</font></p>
<p><font face="Tahoma" size="2"><b><font color="#000000">Vorsicht:</font></b> 
  Bevor Sie mit der Schubdosierung arbeiten, sollten Sie wissen, da&szlig; die 
  Schubstangen eine<b> gro&szlig;e Kraft</b> aus&uuml;ben k&ouml;nnen. <b>Greifen 
  Sie</b> also <b>nicht in den Mechanismus</b>, wenn er sich bewegt.</font></p>
<p><font face="Tahoma" size="2">Nun testen Sie wie folgt:</font></p>
<ol>
  <li><font face="Tahoma" size="2">W&auml;hlen Sie <b>Maschine/CNC-Maschine</b>. 
    Das Fenster Handsteuerung erscheint.</font></li>
  <li><font face="Tahoma" size="2">Geben Sie den <b>CNC-Befehl</b> <font color="#339966" face="Courier New, Courier, mono">M76</font> 
    ein, die Schubstangen m&uuml;ssen ganz nach oben fahren, bis <b>zum Endschalter</b>.</font></li>
  <li><font face="Tahoma" size="2">Dr&uuml;cken Sie im Nummernfeld der Tastatur 
    kurz die Taste <b>[+]</b>, die Schubstangen m&uuml;ssen sich ganz langsam 
    <b>nach unten</b> bewegen. Mit jedem weiteren kurzen Tastendruck wird die 
    Bewegung etwas schneller. Mit dem Dr&uuml;cken auf eine <b>andere Taste stoppen</b> 
    Sie die Bewegung.</font></li>
  <li><font face="Tahoma" size="2">Dr&uuml;cken Sie im Nummernfeld der Tastatur 
    kurz die Taste <b>[-]</b>, die Schubstangen m&uuml;ssen sich ganz langsam 
    <b>nach oben</b> bewegen. Mit jedem weiteren kurzen Tastendruck wird die Bewegung 
    etwas schneller. Mit dem Dr&uuml;cken auf eine <b>andere Taste stoppen</b> 
    Sie die Bewegung. Am Endschalter stoppt sie aber auf jeden Fall.</font></li>
  <li><font face="Tahoma" size="2">Geben Sie jetzt den <b>Befehl</b> <font color="#339966" face="Courier New, Courier, mono">M03 
    S10</font> ein, die <b>Schubstangen bewegen</b> sich nach unten. Sobald Sie 
    <font color="#339966" face="Courier New, Courier, mono">M02</font> eingeben, h&ouml;rt die 
    Bewegung auf. Mit <font color="#339966" face="Courier New, Courier, mono">M03 S20</font> mu&szlig; 
    die Bewegung &uuml;brigens schneller sein.</font></li>
  <li><font face="Tahoma" size="2">Geben Sie jetzt den <b>Befehl</b> <font color="#339966" face="Courier New, Courier, mono">M04 
    S10</font> ein, die <b>Schubstangen bewegen</b> sich nach oben. Sobald Sie 
    <font color="#339966" face="Courier New, Courier, mono">M02</font> eingeben, h&ouml;rt die 
    Bewegung auf. Mit <font color="#339966" face="Courier New, Courier, mono">M04 S20</font> mu&szlig; 
    die Bewegung wiederum schneller sein.</font></li>
</ol>
<p><font face="Tahoma" size="2">Damit ist der Test abgeschlossen.</font></p>
<p>&nbsp;</p>
<p><font face="Tahoma"><b><font color="#FF00FF" size="4">3. </font> <font color="#FF00FF" size="2"> 
  Doppelkartusche montieren und demontieren, Testbetrieb</font></b><font size="2"><br>
  Die folgenden Hinweise sind besonders wichtig und elementar f&uuml;r den zuverl&auml;ssigen 
  und sicheren Betrieb des Dosiersystems.</font></font></p>
<p><font face="Tahoma"><font size="2">Zun&auml;chst mu&szlig; daf&uuml;r gesorgt 
  werden, da&szlig; die <b>Schubstangen ganz oben</b> sind, dazu ist folgendes 
  zu tun:</font></font></p>
<ul>
  <li><font face="Tahoma" size="2">W&auml;hlen Sie <b>Maschine/CNC-Maschine</b>. 
    Das Fenster Handsteuerung erscheint.</font></li>
  <li><font face="Tahoma" size="2">Geben Sie den <b>CNC-Befehl</b> <font color="#339966" face="Courier New, Courier, mono">M76</font> 
    ein, die Schubstangen m&uuml;ssen ganz nach oben fahren, bis <b>zum Endschalter</b>.</font></li>
</ul>
<p><font face="Tahoma"><font size="2">Der Reihe nach ist dann folgendes zu beachten 
  und zu tun:</font></font></p>
<p><font face="Tahoma"><font size="2" color="#FF00FF"><b>3.1 Sicherheitshinweis</b></font><font size="2"><br>
  Das System ist f&uuml;r den Betrieb mit 2-Komponenten-Kartuschen ausgelegt, 
  es mu&szlig; also eine Mischung der beiden Komponenten beim Dosieren stattfinden. 
  Da nach dem Mischvorgang nur eine begrenzte Topfzeit zur Verf&uuml;gung steht, 
  sollten die Kartuschen leer gefahren werden. Immer mu&szlig; die Ruhezeit im 
  Mischrohr wesentlich k&uuml;rzer sein, als die Topfzeit. Ist das Dosiergut im 
  Mischrohr bereits dick oder gar fest geworden, darf in keinem Fall &quot;nachgeschoben&quot; 
  werden, sonst k&ouml;nnen die Kartuschenw&auml;nde platzen und Schaden entstehen.</font></font></p>
<p><font face="Tahoma" size="2" color="#FF00FF"><b>3.2 Vorbereiten von Doppelkartusche 
  und Mischrohr</b></font><font face="Tahoma" size="2"><br>
  Im Lieferzustand ist die Kartusche mit einer Schrift-Banderole umgeben. Bitte 
  lesen und beachten Sie die dort aufgedruckten Angaben und Hinweise. Entfernen 
  Sie die Banderole, damit sie in die Kartuschen-Aufnahme pa&szlig;t.<br>
  Am Mischrohr mu&szlig; mit einem Messer zun&auml;chst das d&uuml;nnste Rohrende 
  abgeschnitten werden, dann kann der LuerLock-Adapter mit der Innengewinde-Seite 
  aufgeschraubt werden. Das Gewinde schneidet sich in den weichen Kunststoff des 
  Mischrohrs. Bitte pr&uuml;fen Sie den geraden und festen Sitz des Adapters. 
  In das Adapterende setzen Sie eine Dosiernadel mit mindestens 0.5 mm Innendurchmmesser.</font></p>
<p><font face="Tahoma" size="2" color="#FF00FF"><b>3.3 Einbau von Kartusche und 
  Mischrohr</b></font><font face="Tahoma" size="2"><br>
  &Ouml;ffnen Sie die Schnellverschl&uuml;sse von Kartuschen-Aufnahme und Mischrohr-Halterung 
  und ziehen Sie die Kartuschen-Aufnahme ab (siehe unten, Bild 4).<br>
  Entfernen Sie jetzt mit einer Zange vorsichtig die beiden Stopfen aus der Kartusche, 
  stecken die Kartusche in die Kartuschen-Aufnahme und stecken Sie beides auf 
  die Schubdosier-Einheit. Dann entfernen Sie den Verschlu&szlig; unten an der 
  Kartusche und schrauben das vorbereitete Mischrohr an die Stelle des Verschlu&szlig;es. 
  Jetzt k&ouml;nnen alle Schnellverschl&uuml;sse wieder geschlossen werden.</font></p>
<p><font face="Tahoma" size="2" color="#FF00FF"><b>3.4 Anfahren der Dosierung</b></font><font face="Tahoma" size="2"><br>
  Mit der <b>Handsteuerung</b> k&ouml;nnen jetzt die Stopfen in die Kartusche 
  eingefahren werden. Dazu dr&uuml;cken Sie im Nummerblock der Tastatur die Taste 
  <b>[+]</b> kurz. Soll schneller abw&auml;rts gefahren werden, dr&uuml;cken Sie 
  die Taste erneut kurz. Mit jeder anderen Taste k&ouml;nnen Sie die Bewegung 
  stoppen.</font></p>
<p><font face="Tahoma" size="2">Lassen Sie die Stopfen unter <b>sorgf&auml;ltiger 
  Beobachtung</b> in die Kartusche einfahren, die O-Ringe m&uuml;ssen sauber eingef&uuml;hgrt 
  werden. Wenn Sie feine Dr&auml;hte zwische O-Ring und Kartuschenwand klemmen, 
  wird die Kartusche oben entl&uuml;ftet und die Materialsteuerung erleichtert. 
  Nach dem Entfernen der Dr&auml;hte m&uuml;ssen die Stopfen gut dichten. Gleichzeitig 
  k&ouml;nnen Sie beim Weiteerfahren beobachten, wie sich das Mischrohr f&uuml;llt.</font></p>
<p><font face="Tahoma" size="2">Bevor das Mischrohr ganz gef&uuml;llt ist, sollten 
  Sie einen <b>Lappen</b> oder ein weiches Papier unter die Dosiernadel legen, 
  damit Y-Tisch und Halterung nicht verschmutzt werden.</font></p>
<p><font face="Tahoma" size="2">Mit der Handsteuerung k&ouml;nnen Sie nun schieben 
  (Taste [+] im Nummernblock) oder saugen (Taste [-]). Sie werden ein Gef&uuml;hl 
  f&uuml;r die Verz&ouml;gerungen und das Nachlaufen bekommen.</font></p>
<p><font size="2" face="Tahoma"><b>Die Kraft der Schubdosierung</b> kann unter 
  Umst&auml;nden zu gro&szlig; sein. Wenn die Elektronik &uuml;ber eine <b>Einstellm&ouml;glichkeit 
  f&uuml;r die Schubkraft </b>verf&uuml;gt, gilt:</font></p>
<ul>
  <li><font size="2" face="Tahoma">Beide Potis m&uuml;ssen etwa dieselbe Winkelstellung 
    haben.</font></li>
  <li><font size="2" face="Tahoma">Rechtsanschlag bedeutet h&ouml;chste Schubkraft.</font></li>
  <li><font size="2" face="Tahoma">Wenn Sie beide Potis nach links drehen, verringert 
    sich die Schubkraft. Wenn der Schubmotor h&ouml;rbar &quot;durchdreht&quot;, 
    sind Sie zu weit gegangen. Diese Einstellung mu&szlig; an das Dosiergut angepasst 
    werden, zu hohe Kraft bei zu d&uuml;nner Dosiernadel kann zum &quot;sprengen&quot; 
    der Kartusche f&uuml;hren.</font></li>
</ul>
<p><font face="Tahoma" size="2" color="#FF00FF"><b>3.5 Testprogramm abfahren</b></font><font face="Tahoma" size="2"><br>
  Im Men&uuml; <b>Datei/CNC-Programm &ouml;ffnen</b> w&auml;hlen Sie ein <b>Programm 
  zum Testen</b> aus (in der Regel auf Diskette mitgeliefert).</font></p>
<p><font face="Tahoma" size="2">Im Men&uuml;<b>Maschine/CNC-Maschine</b> w&auml;hlen 
  Sie erneut die <b>Handsteuerung</b>. Legen Sie nun beispielsweise ein <b>Papier 
  unter die Dosiernadel</b>, stellen Sie mit der Handsteuerung die Dosiernadel 
  an einen <b>sinnvollen Anfangspunkt</b> etwa 1 mm &uuml;ber dem Papier und &uuml;bernehmen 
  diesen mit der Tastenkombination <b>[Strg] + [Ende] als Nullpunkt</b>.</font></p>
<p><font face="Tahoma" size="2">Mit der Tastenkombination <b>[Alt] + [A] starten</b> 
  Sie die <b>Ausf&uuml;hrung</b>, die mit [Return] noch best&auml;tigt werden 
  mu&szlig;. Beobachten Sie die Dosierung und das Nachlaufen am Ende. Sollte ein<b> 
  Problem</b> auftreten, dr&uuml;cken Sie eine <b>beliebige Taste</b>, um in die 
  Handsteureung zur&uuml;ckzukehren.</font></p>
<p><font face="Tahoma" size="2">Wenn Sie die <b>Handsteuerung verlassen</b> (Klick 
  auf den Button &quot;CNC-Maschine Ende&quot;), sind Sie im <b>CNC-Editor</b> 
  und k&ouml;nnen das Programm ab&auml;ndern, es ist gut dokumentiert.</font></p>
<p><font face="Tahoma" size="2" color="#FF00FF"><b>3.6 Demontage der Kartusche</b></font><font face="Tahoma" size="2"><br>
  Wenn die <b>Kartusche ganz leergefahren</b> ist (egal, ob am Ende eines Testbetriebes 
  oder innerhalb des Fertigungseinsatzes) rufen Sie die <b>Handsteuerung</b> auf 
  und geben den Befehl <font face="Courier New, Courier, mono"><b>M76</b></font> 
  ein. Die Schubstangen fahren ganz nach oben bis zum Endschalter. Nun k&ouml;nnen 
  die Schnellverschl&uuml;sse ge&ouml;ffnet werden (Zustand lt. Bild 4).<br>
  </font></p>
<table width="75%" border="0">
  <tr> 
    <td width="32%"><font face="Tahoma" size="2"><img src="Bilder/Schubdos_KartuscheWechsel.jpg" width="200" height="297"></font></td>
    <td width="68%" valign="baseline"> 
      <p align="left"><font face="Arial" size="2" color="#808080"><b><i>Bild 4:</i></b> 
        Die ge&ouml;ffneten Schnellverschl&uuml;sse f&uuml;r die Kartuschen-Aufnahme 
        (im Bild oben) und f&uuml;r das Mischrohr (im Bild unten).<br>
        Das Bild</font><font face="Arial" size="2" color="#808080"> zeigt &uuml;brigens 
        den Zustand nach dem Leerfahren einer Kartusche. Die Stopfen wurden ganz 
        nach oben gefahren (CNC-Befehl M76), an ihnen h&auml;ngen noch die Reste 
        des Dosiergutes. <br>
        Am Rande sei vermerkt: F&uuml;r Testzwecke wurde hier Senf und Tomatenmark 
        verwendet, beides recht unkritische Materialien.</font></p>
    </td>
  </tr>
</table>
<p align="left"><font face="Tahoma" size="2" color="#000000"> Die <b>Kartusche 
  samt Mischrohr</b> kann <b>entfernt</b> werden. Mit der Taste [+] bewegen Sie 
  die <b>Stopfen</b> wieder soweit <b>nach unten</b>, da&szlig; Sie <b>gereinigt</b> 
  werden k&ouml;nnen, dann geben Sie erneut</font><font face="Tahoma" size="2"><font color="#339966" face="Courier New, Courier, mono"> 
  M76</font></font><font face="Tahoma" size="2" color="#000000"> ein, um in die 
  <b>Ausgangsstellung</b> zur&uuml;ckzukehren.</font></p>
<p align="left">&nbsp;</p>
<p align="left"><font face="Times New Roman" size="6" color="#FF00FF"><b><font face="Tahoma" size="4">4.</font><font face="Tahoma" size="2"> 
  Programmbetrieb</font></b></font><font face="Tahoma" size="2" color="#000000"><br>
  Ziel ist der automatische Ablauf einer Dosierung. Bei der &Uuml;bergabe des 
  Systems wurden bereits Programme bereitgestellt, soda&szlig; das System sofort 
  eingesetzt werden kann. Im Folgenden soll erkl&auml;rt werden, wie beim Start 
  eines fertigen Programms zu verfahren ist und wie ein neues Programm erstellt 
  werden kann.</font></p>
<p align="left"><font face="Tahoma" size="2" color="#FF00FF"><b>4.1 Fertiges Programm 
  Starten</b></font><font face="Tahoma" size="2" color="#000000"><br>
  </font><font face="Tahoma" size="2">Im Men&uuml; <b>Datei/CNC-Programm &ouml;ffnen</b> 
  w&auml;hlen Sie ein <b>Programm</b> aus.</font></p>
<p><font face="Tahoma" size="2">Im Men&uuml; <b>Maschine/CNC-Maschine</b> w&auml;hlen 
  Sie erneut die <b>Handsteuerung</b> und Dr&uuml;cken <b>[Pos1]</b>, um einen 
  Referenzlauf zu machen. Dann dr&uuml;cken Sie <b>[Entf]</b>, um in die Ausspannposition 
  zu fahren. <b>Befestigen</b> Sie nun die <b>dazugeh&ouml;rige Halterung auf 
  dem Y-Tisch.</b> </font></p>
<p><font face="Tahoma" size="2">Entsprechend der <b>Hinweise von Kapitel 3 bis 
  3.4</b> mu&szlig; eine <b>Kartusche montiert</b>- und die Dosierung angefahren 
  sein. Die Dosierung mu&szlig; durch entsprechendes Zur&uuml;ckziehen der Stopfen 
  gestoppt- und die Nadel frei von R&uuml;ckst&auml;nden sein. Dann mu&szlig; 
  der Nullpunkt eingelernt- bzw. zur Kontrolle angefahren werden (siehe Bild 5).<br>
  </font></p>
<table width="75%" border="0">
  <tr>
    <td width="16%"><img src="Bilder/Schubdos_Nullpunkte.jpg" width="100" height="91"></td>
    <td width="84%" valign="baseline"> 
      <p align="left"><font face="Arial" size="2" color="#808080"><b><i>Bild 5:</i></b> 
        Die Dosiernadel &uuml;ber dem Nullpunkt.<br>
        Die Halterung ist dabei ganz am Anschlag des Y-Tisches befestigt. Der 
        Nullpunkt f&uuml;r die Dosierung ist besonders auf der Halterung markiert- 
        auf ihn mu&szlig; die Dosiernadel exakt positioniert werden.</font></p>
    </td>
  </tr>
</table>
<p><font face="Tahoma" size="2"> </font><font face="Tahoma" size="2"><br>
  Fahren Sie mit der <b>Handsteuerung</b> die Dosiernadel exakt an den <b>markierten 
  Nullpunkt</b> und &uuml;bernehmen Sie diesen mit der Tastenkombination <b>[Strg] 
  + [Ende] als Nullpunkt</b>.</font></p>
<p><font face="Tahoma" size="2">Mit der Tastenkombination <b>[Alt] + [A] starten</b> 
  Sie die <b>Ausf&uuml;hrung</b>, die mit [Return] noch best&auml;tigt werden 
  mu&szlig;. Beobachten Sie die Dosierung und das Nachlaufen am Ende. Sollte ein<b> 
  Problem</b> auftreten, dr&uuml;cken Sie eine <b>beliebige Taste</b>, um in die 
  Handsteureung zur&uuml;ckzukehren.</font></p>
<p><font face="Tahoma" size="2">Eine <b>Wiederholung</b> des Programms kann durch 
  <b>zweimaliges</b> Dr&uuml;cken der Taste <b>[Return] </b>erreicht werden.</font></p>
<p><font face="Tahoma" size="2">Wenn Sie die <b>Handsteuerung verlassen</b> (Klick 
  auf den Button &quot;CNC-Maschine Ende&quot;), sind Sie im <b>CNC-Editor</b> 
  und k&ouml;nnen das Programm ab&auml;ndern, es ist gut dokumentiert.</font></p>
<p><font face="Tahoma" size="2" color="#FF00FF"><b>4.2 Einlernen einer neuen Dosierbahn</b></font><font face="Tahoma" size="2"><br>
  Hier bietet sich das sog. TeachIn-Verfahren an. Es wird von nccad unmittelbar 
  unterst&uuml;tzt. Es sind die folgenden T&auml;tigkeiten auszuf&uuml;hren</font> 
</p>
<ol>
  <li><font face="Tahoma" size="2" color="#000000">Im Men&uuml; <b>Datei/CNC neues 
    Programm </b> &ouml;ffnen Sie den CNC-Editor, ein leeres Textfeld erscheint.</font></li>
  <li><font face="Tahoma" size="2">Innerhalb der Software <i><b>nccad</b></i> 
    w&auml;hlen Sie <b>Maschine/CNC-Maschine</b>. Das Fenster Handsteuerung erscheint.</font></li>
  <li><font face="Tahoma" size="2">Dr&uuml;cken Sie die Taste<b> [Pos 1]</b>, 
    die 3 Tische des Koordinatentisch-Systems laufen an die Endschalter. Man nennt 
    dies einen <b>Referenzlauf</b>.</font></li>
  <li><font face="Tahoma" size="2">Dr&uuml;cken Sie die Taste <b>[Entf]</b>, der 
    Y-Tisch kommt Ihnen ganz entgegen, dies ist die <b>Ausspannposition</b>.</font></li>
  <li><font face="Tahoma" size="2">Spannen Sie z.B. eine <b>Halterung</b> f&uuml;r 
    eine Geh&auml;useschale, b&uuml;ndig mit den Anschlagleisten, ein.</font></li>
  <li><font face="Tahoma" size="2">Montieren Sie an der unteren Halterung f&uuml;r 
    das Mischrohr eine provisorische <b>Tastspitze</b>.</font></li>
  <li><font face="Tahoma" size="2">Fahren Sie mithilfe der<b> Cursortasten</b> 
    die Me&szlig;spitze an die markierte Stelle <b>&quot;Nullpunkt&quot;</b> auf 
    der Halterung.</font></li>
  <li><font face="Tahoma" size="2">Dr&uuml;cken Sie die Tastenkombination <b>[Strg] 
    + [Ende]</b>, die Anzeige der Koordinaten (gr&uuml;ne Felder) mu&szlig; auf 
    <b>Null</b> gehen. Versichern Sie sich noch, da&szlig; der Werkst&uuml;ck-Nullpunkt 
    <b>(WNP) Nr. 2 </b> angew&auml;hlt ist.</font></li>
  <li><font face="Tahoma" size="2"><b>Fahren</b> Sie nun mithilfe der Cursortasten 
    die <b>Kontur ab</b>. An den <b>Eckpunkten</b> dr&uuml;cken Sie die Taste 
    <b>[Einfg]</b>, in das Editierfeld wird ein CNC-Befehl eingef&uuml;gt</font><font face="Tahoma" size="2">.</font></li>
  <li><font face="Tahoma" size="2">Wenn Sie die <b>Handsteuerung verlassen</b> 
    (Klick auf den Button &quot;CNC-Maschine Ende&quot;), sind Sie im <b>CNC-Editor</b> 
    und k&ouml;nnen das Programm erg&auml;nzen. Folgende Befehle m&uuml;ssen beispielsweise 
    f&uuml;r die Steuerung der Dosierung noch erg&auml;nzt werden:<br>
    <font face="Courier New, Courier, mono"><br>
    <font color="#339966">G00 X0 Y0 Z8 F100<br>
    <br>
    M03 S5 <br>
    M35 P20<br>
    M03 S1<br>
    <br>
    <font size="1">....<br>
    G01 X.... Y.... Z....<br>
    ....</font><font face="Courier New, Courier, mono"><br>
    <br>
    M04 S5<br>
    M35 P20<br>
    M02<br>
    <br>
    G00 Z8<br>
    G00 X0 Y200</font></font><br>
    <br>
    <font face="Tahoma" size="1">Am Anfang ist eine Startposition anzufahren und 
    eine Angabe f&uuml;r den Vorschub der Koordinatentische zu machen (F...). 
    Dann m&uuml;ssen die Stopfen in einer h&ouml;heren Geschwindigkeit (S...) 
    f&uuml;r eine bestimmte Zeit (P...) nach unten gefahren werden, bis Dosiergut 
    flie&szlig;t. Danach wird der Stopfenvorschub verlangsamt. Es folgt das Abfahren 
    der eingelernten Kontur (kleingedruckter Mittelteil des Programms). Am Ende 
    m&uuml;ssen die Stopfen <b>genauso schnell</b> und <b>genauso lang</b> zur&uuml;ckgezogen 
    werden, <b>wie</b> sie <b>am Anfang</b> eingefahren wurden (die Werte f&uuml;r 
    S und P mussen also die gleichen sein). Mit M02 wird dann die Bewegung der 
    Schubstange ausgeschaltet und am Programmende noch eine sinnvolle Ausspannposition 
    angefahren.</font><br>
    <br>
    </font></font></li>
  <li> <font face="Tahoma" size="2" color="#000000"><b>Kommentieren</b> Sie das 
    Programm entsprechend den mitgelieferten Programmen.</font> 
  <li> <font face="Tahoma" size="2" color="#000000"><b>Speichern</b> Sie das neue 
    Programm unter einem sinnvollen Namen ab</font>. 
</ol>
<p><font face="Tahoma" size="2">Damit ist das TeachIn und die Programmerstellung 
  abgeschlossen. Einen Programmlauf machen Sie entsprechend 4.1.</font></p>
<p>&nbsp;</p>
<p><font face="Times New Roman" size="6" color="#FF00FF"><b><font face="Tahoma" size="4">5.</font><font face="Tahoma" size="2"> 
  Wartung / Service</font></b></font><font face="Tahoma" size="2" color="#000000"><br>
  Die entsprechenden Hinweise f&uuml;r die CNC-Maschine finden Sie im Handbuch. 
  </font></p>
<p><font face="Tahoma" size="2" color="#000000">F&uuml;r die Schubdosierung sind 
  folgende Punkte zu beachten:</font></p>
<ul>
  <li><font face="Tahoma" size="2">Die F&uuml;hrungen und die Spindel f&uuml;r 
    die Schubdosierung sind sauber zu halten und etwas zu &ouml;len.</font></li>
  <li><font face="Tahoma" size="2" color="#000000">Die Stopfen m&uuml;ssen nach 
    dem Leerfahren der Kartusche gereinigt werden. Sie sollten sich einige O-Ringe 
    von den Originalstopfen als Reserve aufbewahren, um von Zeit zu Zeit neue 
    einsetzen zu k&ouml;nnen.</font></li>
</ul>
<p align="left"><font face="Tahoma" size="2" color="#000000"> </font> </p>
</body>

</html>
