<html>

<head>
<meta http-equiv="Content-Language" content="de">
<meta http-equiv="Content-Type" content="text/html; charset=windows-1252">
<meta name="GENERATOR" content="Microsoft FrontPage 4.0">
<meta name="ProgId" content="FrontPage.Editor.Document">
<title>KOSY-Hilfe/Anhang/Technologie-Angaben</title>
</head>

<body bgcolor="#FFFFFF">
<p><i><b><font color="#FF00FF" size="6" face="Times New Roman">Technologie-Angaben</font></b></i><font face="Tahoma" size="2"><br>
  Die Technologie-Angaben dienen als Erg&auml;nzung zu den gezeichneten geometrischen 
  Figuren, um die Bearbeitung mit der CNC-Maschine zu erm&ouml;glichen. Es muss 
  beispielsweise angegeben werden: Wie schnell, wie tief, mit welcher Zustellung 
  und auf welche Weise die gezeichnete Figur bearbeitet werden soll.<br>
  Besonders leistungsf&auml;hig wird<b> <i> nccad</i> </b>dadurch, dass jedem 
  Zeichnungsteil eine eigene Technologie zugeordnet werden kann, d.h. jedes der 
  gezeichneten Teile kann unterschiedlich bearbeitet werden. Dazu erh&auml;lt 
  es &uuml;ber eine "Zuordnungslinie" und &uuml;ber die Nummerierung seine spezifischen 
  Technologiedaten. Eine Gleichbehandlung aller Teile ist ebenfalls m&ouml;glich, 
  indem nur einem der Teile eine Technologie zugeordnet wird, die die Nummer 0 
  erh&auml;lt. Sollen einige Zeichnungsteile individuell bearbeitet werden und 
  ein Rest gleichbehandelt werden, so ist auch dies &uuml;ber die Nummernvergabe 
  erreichbar.</font></p>
<p><font face="Tahoma" size="2">Ab <i><b>nccad6</b></i> sind die verschiedenen 
  Technologie-Fenster als sog. <b>Karteikarten</b> ausgef&uuml;hrt und &uuml;ber 
  einen Klick auf den zugeh&ouml;rigen <b>Reiter</b> erreichbar.</font></p>

<p>&nbsp;</p>

<p><font face="Tahoma" size="2"><img src="Bilder/Techno_HauptFenster.gif" width="438" height="533"><br>
  </font><b><font color="#FF00FF" face="Tahoma" size="5">1.</font><font face="Tahoma" size="2" color="#FF00FF"> 
  Technologie-Angaben, Karteikarte &quot;Bearbeitung&quot;</font></b></p>
<p><font face="Tahoma" size="2"><font color="#FF00FF"><b>1.1</b> Nummernvergabe</font><br>
  Die einzelnen <b>Zeichnungsteile</b> werden entsprechend der <b>Nummern-Reihenfolge 
  abgearbeitet</b>. Technologisch sinnvolle Reihenfolge w&auml;hlen! Eine Nummer 
  wird vorgeschlagen und automatisch hochgez&auml;hlt. Wollen Sie diesen Vorschlag 
  nicht &uuml;bernehmen, klicken Sie dazu die Zahl hinter dem Text "Nummer:" an 
  und geben Sie die Zahl ein. Nummern d&uuml;rfen ausgelassen werden (L&uuml;cken). 
  Bei komplexeren Formen muss auf weitere LAYER ausgewichen werden. Die Nummerndarstellung 
  an der Zuordnungslinie ber&uuml;cksichtigt dies. Die LAYER 9 und 10 sind dabei 
  nicht zug&auml;nglich. An der CNC-Maschine werden zuerst die Teile im Layer 
  1- dann die im Layer 2-, usw. abgearbeitet. Bei Vollkreisen beginnt die Zuordnungslinie 
  immer an einem Punkt des Kreises (mit Fang arbeiten), vorgegebene Drehrichtung 
  ist der Uhrzeigersinn. <br>
  <b><a name="Bohren"></a>Punkte</b> sind Bohrungen. Sind mehrere Punkte im gleichen 
  Layer (gleiche Farbe), braucht nur einer der Punkte eine Technologie-Zuordnung!</font></p>
<p><font face="Tahoma" size="2"><font color="#FF00FF"><b>1.1.1</b> Nummer 0 (All-Funktion)</font><br>
Wird  dem ersten Zeichnungsteil die Nummer 0 angegeben, dann gelten die zugeh&ouml;rigen Technologie-Informationen nicht nur f&uuml;r dieses Zeichnungsteil, sondern f&uuml;r alle nicht zugeordneten Zeichnungsteile im Layer 1 bzw. f&uuml;r alle nicht zugeordneten
Zeichnungsteile des genannten Layers (z.B.:  NR 0/3  f&uuml;r Zeichnungsteile im Layer 3). Dies bedeutet, dass alle weiteren Zeichnungsteile von der CNC-Maschine gleich behandelt werden.  Sollen einzelne Zeichnungsteile v&ouml;llig anders
bearbeitet werden, k&ouml;nnen sie eine Nummer gr&ouml;ﬂer 0  erhalten,  sie  werden  dann zuerst abgearbeitet.  Die ALL-Funktion erkennt Stufenbohrungen
automatisch, wenn zwei Kreise ineinander gezeichnet sind (sinnvolle Angaben f&uuml;r "Teilzustellung" und "Tiefe 1. Stufe" sind dann allerdings erforderlich).  F&uuml;r Gravurtexte  gilt als Eintauchtiefe  die
&quot;Gesamttiefe&quot;.  Diese ALL-Funktion spart das Erstellen von vielen Zuordnungen und hat seine besondere Bedeutung z.B. beim Fr&auml;sen/Gravieren von Bildern oder
Leiterplatten.  Siehe auch die Beispiel-Dateien  ALLDEMO .</font></p>
<p><font face="Tahoma" size="2"><font color="#FF00FF"><b><a name="InversFraesen"></a>1.1.2</b> 
  Nummer 1000 (Invers-Fr&auml;sen)</font><br>
  Diese Funktion dient beispielsweise zur Herstellung von Druckstempeln oder Leiterplatten. 
  Die Umgebung einer geschlossenen Kontur wird automatisch ausger&auml;umt. Bei 
  der Erstellung der Zeichnung und der Technologie-Angaben ist folgendes zu beachten: 
  - Die gezeichneten Konturen m&uuml;ssen in sich geschlossen sein (Rechteck. 
  Kreis, Outline-Schrift, geschlossener Polygonzug ohne Unterbrechung). - Die 
  auszur&auml;umende Fl&auml;che muss mit einem Rechteck eingerahmt sein, der 
  die Technologie-Nummer 1000 erh&auml;lt. - Die Kontur und der rechteckige Rahmen 
  m&uuml;ssen mit dem Fr&auml;ser abgefahren werden, was in jedem Fall durch die 
  Technologie-Nummer 0 erreicht wird. - Der Werkzeugdurchmesser muss unbedingt 
  angegeben werden. Die Nummer 1000 bewirkt ein zeilenf&ouml;rmiges Bearbeiten 
  der Innenfl&auml;che. Trifft der Fr&auml;ser auf eine Konturenlinie, f&auml;hrt 
  er hoch. Bei der n&auml;chsten Konturenlinie f&auml;hrt er wieder nach unten 
  usw. Die Invers-Fr&auml;sfunktion wird nur in dem Layer aktiviert, in dem sich 
  die zugeh&ouml;rigen Zeichnungsteile (mit gleicher Farbe) befinden. Auf diese 
  Weise k&ouml;nnen in verschiedenen Layern verschiedene Invers-Fl&auml;chen hergestellt 
  werden.</font></p>
<p><font face="Tahoma" size="2"><font color="#FF00FF"><b>1.1.3</b> Nummer 1000 mit Umkehrung</font><br>
Invers-Fr&auml;sen mit Umkehrfunktion f&uuml;r Guﬂformen und besondere gestalterische Effekte.  Das Invers-Fr&auml;sen wird normalerweise f&uuml;r die
Leiterplatten-Herstellung und f&uuml;r Druckstempel benutzt. Die gezeichnete Figur bleibt dabei erhaben stehen, die Umgebung wird tiefer gefr&auml;st. Was aber ist zu tun, wenn die gezeichnete Figur tiefer als die Umgebung gefr&auml;st werden soll? Hier ein Beispiel: 1.Schritt: Zeichnen der Figur als geschlossener Polygonzug. Beim Zeichnen darf der Polygonzug nicht unterbrochen werden. 2. Schritt: Zeichnen eines
Rechteckrahmens (1. innerer Rahmen). 3. Schritt: Bearbeiten der Technologie-Angaben. Der Rechteckrahmen erh&auml;lt die Nummer 1000 zur Erzeugung der "Ausr&auml;umbahnen". 4. Schritt: Zeichnen eines 2. &auml;uﬂeren Rahmens im Abstand von mindestens einem Fr&auml;serdurchmesser vom 1. Rahmen. Durch den  zus&auml;tzlichen Rahmen wird eine weitere &Auml;nderung der Z-Position eingef&uuml;gt, die innere Figur wird tief gefr&auml;st.</font></p>
<p><font face="Tahoma" size="2"><font color="#FF00FF"><b>1.2</b> Layer</font><br>
Das Feld &quot;Layer&quot; wird normalerweise automatisch mit der richtigen Zahl gef&uuml;llt, sobald Sie ein
Zeichnungsteil f&uuml;r die Zuordnung der Technologie ausgew&auml;hlt haben.</font></p>
<p><font face="Tahoma" size="2"><font color="#FF00FF"><b>1.3</b> Fr&auml;steil</font><br>
In diesem Feld wird die Reihenfolge der Abarbeitung angezeigt. Fr&auml;steil 5 bedeutet also, dass dieses
Zeichnungsteil als f&uuml;nftes bearbeitet wird. Die hier genannte Zahl ist nicht editierbar, sie muss auch nicht mit der Nummer &uuml;bereinstimmen, denn bei der Nummernvergabe sind L&uuml;cken zugelassen.</font></p>
<p><font face="Tahoma" size="2"><font color="#FF00FF"><b>1.4</b> Bearbeitung</font><br>
Die m&ouml;glichen Bearbeitungen sind in der Tabelle auf der n&auml;chsten Seite zusammengefasst. F&uuml;r ein
bestimmtes Zeichnungsteil ist nicht jede denkbare Bearbeitung zugelassen, d.h. bei einem Punkt kann die Bearbeitung "Stufenbohrung" beispielsweise nicht angew&auml;hlt werden.  Eine gew&uuml;nschte Bearbeitung wird eingestellt indem Sie das Auswahlfeld anklicken und dann die gew&uuml;nschte- und m&ouml;gliche Vorgabe ausw&auml;hlen</font></p>
<p><font face="Tahoma" size="2"><font color="#FF00FF"><b>1.4.1</b> Einzelteil</font><br>
  Das ausgew&auml;hlte Zeichnungsteil ist eine einzige geometrische Figur (Kreis, 
  Rechteck, Punkt) die als Kontur oder Bohrung herausgearbeitet werden soll.</font></p>
<p><font face="Tahoma" size="2"><font color="#FF00FF"><b>1.4.2</b> Bahn offen</font><br>
Das ausgew&auml;hlte Zeichnungsteil ist Anfangs- oder Endteil einer "Bahn"  von zusammenh&auml;ngenden Figuren (Bogen, Gerade, Polygonzug) mit zwei Enden.</font></p>
<p><font face="Tahoma" size="2"><font color="#FF00FF"><b>1.4.3</b> Bahn geschlossen</font><br>
Das ausgew&auml;hlte Zeichnungsteil ist Teil einer "Bahn"  von zusammen-h&auml;ngenden Figuren (Bogen, Gerade, Polygonzug) deren zwei Enden miteinander verbunden sind.</font></p>
<p><font face="Tahoma" size="2"><font color="#FF00FF"><b>1.4.4</b> Stufenbohrung</font><br>
Das ausgew&auml;hlte Zeichnungsteil ist das &auml;uﬂere von 2 zusammengeh&ouml;renden gleichen Teilen (konzentrische Kreise oder Langl&ouml;cher), die in der Draufsicht eine Stufenbohrung darstellen.</font></p>
<p><font face="Tahoma" size="2"><font color="#FF00FF"><b>1.4.5</b> Sackloch</font><br>
  Das ausgew&auml;hlte Zeichnungsteil ist <b>eine einzige regelm&auml;&szlig;ige 
  geometrische Figur</b> (Kreis, Rechteck, Langloch), deren Innenfl&auml;che ausger&auml;umt 
  werden soll, die Bahnkorrektur- und Steuerung erfolgt automatisch.</font></p>
<p><font face="Tahoma" size="2"><font color="#FF00FF"><b>1.4.6 </b>Tasche</font><br>
  Sollen <b>nicht regelm&auml;&szlig;igen geometrischen Konturen</b> (Vielecke, 
  zusammengesetzte Konturen u.&Auml;.), die als <b>geschlossene Bahn</b> gezeichnet 
  sind, im <b>Inneren ausgefr&auml;st</b> werden, mu&szlig; die Bearbeitung &quot;<b>Tasche</b>&quot; 
  (nicht Sackloch) gew&auml;hlt werden.<br>
  Bitte die Angaben f&uuml;r &Uuml;berlappungsfaktor und Winkel &uuml;berpr&uuml;fen! 
  Es ist durchaus m&ouml;glich, dass mit der gew&auml;hlten Technologie keine 
  befriedigenden Ergebnisse entstehen, Sie sollten dann mit verschiedenen Einstellungen 
  experimentieren.</font></p>
<p><font face="Tahoma" size="2"><font color="#FF00FF"><b>1.4.6.1</b> Konturparallel/Winkelparallel</font><br>
  Beliebige Fl&auml;chen k&ouml;nnen mit dieser Technologie innen ausger&auml;umt 
  werden (Taschenfr&auml;sen). Bedingungen: Es m&uuml;ssen geschlossene Konturen 
  sein, ansonsten sollten Sie zuvor die Funktion Bearbeitung -KONTURVERFOLGUNG 
  anwenden. Eine "Vorschau" ist &uuml;ber die Funktion Bearbeitung -TASCHE in 
  der Konstruktionsebene m&ouml;glich. Nach der Vorschau kann diese mit R&Uuml;CKG&Auml;NGIG 
  (Undo) wieder gel&ouml;scht werden.</font></p>
<p><font face="Tahoma" size="2"><font color="#FF00FF"><b>1.5</b> Bahnkorrektur</font><br>
  Eine der St&auml;rken von <i> <b>nccad</b></i> ist die F&auml;higkeit, Fr&auml;sbahnkorrekturen 
  zu verarbeiten. Sie zeichnen die "Fertigkontur" und legen &uuml;ber die Technologie-Angaben 
  fest wo der Fr&auml;ser seinen Fahrweg (seine Bahn) hat. Die Mathematik dazu 
  ist sehr komplex und die Zahl der Sonderf&auml;lle sehr umfangreich, deshalb 
  gibt es einige Regeln. Durch die eingebaute Intelligenz werden Verkn&uuml;pfungen 
  automatisiert, also der Bedienkomfort erh&ouml;ht. Eine gew&uuml;nschte Bahnkorrektur 
  wird eingestellt indem Sie das Auswahlfeld anklicken und dann die gew&uuml;nschte- 
  und m&ouml;gliche Vorgabe ausw&auml;hlen. Bitte beachten Sie, dass nicht alle 
  F&auml;lle von Bahnkorrektur zu eindeutigen Ergebnissen f&uuml;hren k&ouml;nnen. 
  Ein Grundlagenversuch- und die Grafik-Simulation im Vorfeld der eigentlichen 
  Konstruktion und Werkst&uuml;ckbearbeitung ist zu empfehlen.</font></p>
<p><font face="Tahoma" size="2"><font color="#FF00FF"><b>1.5.1</b> Keine</font><br>
Das ausgew&auml;hlte Zeichnungsteil   wird wie gezeichnet abgefahren. Es entsteht eine Fr&auml;s/Gravierlinie, deren Breite vom Werkzeug bzw. von der Eintauchtiefe abh&auml;ngt</font></p>
<p><font face="Tahoma" size="2"><font color="#FF00FF"><b>1.5.2</b> innen/auﬂen/links/rechts</font><br>
Die Fr&auml;sbahn wird wie dargestellt versetzt. Dazu ist unbedingt eine Angabe f&uuml;r den Werkzeugdurchmesser erforderlich.</font></p>
<p><font face="Tahoma" size="2"><font color="#FF00FF"><b><a name="Tiefloch"></a>1.5.3</b> 
  Tiefloch Innen/Auﬂen</font><br>
  !! Nur in Verbindung mit &quot;Bearbeitung - Einzelteil&quot; und nicht Nummer 
  0 !!<br>
  Bei <b>Punkten</b> (Bohrungen) f&uuml;hrt der Tieflochzyklus zu einem "Pumpen" 
  der Bohrbewegung, damit die Sp&auml;ne besser ausger&auml;umt werden k&ouml;nnen. 
  Bei <b>Kreisen</b> kann der Tieflochzyklus Innen/Auﬂen gew&auml;hlt werden. 
  Er f&uuml;hrt zu doppelten Fr&auml;sbahnen bei jeder Zustellung, um "Freiraum" 
  f&uuml;r Fr&auml;ser- und Materialkern zu schaffen. Bei "Innen" stimmt das Innenmaﬂ 
  des gezeichneten Loches, bei &quot;Auﬂen&quot; das Auﬂenmaﬂ. Es m&uuml;ssen 
  sinnvolle Angaben f&uuml;r "Werkzeugdurchmesser", "Ge-samttiefe", "Teilzustellung" 
  und "Tiefe 1. Stufe" gemacht werden.</font></p>
<p><font face="Tahoma" size="2"><font color="#FF00FF"><b>1.5.4</b> Automatisch</font><br>
Bei Sackl&ouml;chern (Kreis, Rechteck, Langloch) ist jede andere Art der Bahnkorrektur ausgeschlossen. Bei Stufenbohrungen (2 konzentrische Kreise, 2 Langl&ouml;cher- eines innenliegend aber auch versetzt m&ouml;glich) sind andere
Bahnkorrektur-Arten ausgeschlossen. Es m&uuml;ssen sinnvolle Angaben f&uuml;r
&quot;Werkzeugdurchmesser&quot;, "Gesamttiefe", "Teilzustellung" und "Tiefe 1. Stufe" gemacht werden.</font></p>
<p><font face="Tahoma" size="2"><font color="#FF00FF"><b>1.6</b> Relais vorher/nachher</font><br>
Bevor ein Teil bearbeitet wird, m&uuml;ssen eventuell eines- oder mehrere der 6 Relais geschaltet werden. Ebenso ist zu entscheiden, was mit dem- oder den Relais geschehen soll, nachdem das Zeichnungsteil bearbeitet ist. Die 6 Relais sind durch Felder
dargestellt, ganz links Relais Nr. 1 (f&uuml;r die verstellbare Hilfsspannung), dann die Relais 2 bis 5 (zur freien Verf&uuml;gung) und ganz rechts Relais Nr. 6 (f&uuml;r die 220 V-Buchse zur Bearbeitungseinheit BAE).  Klicken Sie in ein solches Feld, wird es markiert, erneutes Klicken schaltet wieder AUS. Wenn Sie Relais 6 f&uuml;r die Bearbeitungseinheit
&quot;vorher&quot; einschalten wird automatisch auch "nachher" aktiviert. Dies dient der Sicherheit f&uuml;r den Fall dass mehrere weitere
Zeichnungsteile bearbeitet werden m&uuml;ssen und Sie vergessen die Bearbeitungseinheit wieder einzuschalten.</font></p>
<p><font face="Tahoma" size="2"><font color="#FF00FF"><b>1.7</b> Sicherheitsabstand</font><br>
Bei Nichteingriff in das Werkst&uuml;ck befindet sich das Werkzeug zum Verfahren &uuml;ber Hindernisse hinweg  soweit &uuml;ber dem Werkst&uuml;ck-Nullpunkt, wie hier angegeben.  Wird die Referenz-Oberfl&auml;che mit einer Angabe im Feld "Z-Nullpunkt verschieben" verstellt, dann wird der
Z-Achsen-Sicherheitsabstand um die gr&ouml;ﬂte Angabe erh&ouml;ht. Damit ist gew&auml;hrleistet, dass beim Verfahren &uuml;ber stufige K&ouml;rper das Werkzeug immer hoch genug bewegt wird, um
nirgends anzustoﬂen.  Die  Standardeinstellung  ohne  Angabe  ist  ein  Z-Achsen-Sicherheitsabstand   von  5 mm.</font></p>
<p><font face="Tahoma" size="2"><font color="#FF00FF"><b>1.8 </b>STOP f&uuml;r Handbedienung</font><br>
Wird bei einem Zeichnungsteil das Feld  "STOP f&uuml;r Handbedienung"  aktiviert, so wird der
Programmablauf bei der CNC-Maschine vor der Abarbeitung dieses Zeichnungsteils angehalten und der
Handbetrieb eingeschaltet. Hier kann das Werkzeug gewechselt- und u.U. ein neuer Werkzeug-Nullpunkt gesetzt werden.  Der Programmablauf wird dann durch Dr&uuml;cken von  Strg+F   fortgesetzt.  Beispiel:  Nach der Abarbeitung des Rechtecks NR 1 wird der Programmablauf angehalten, um vor der Abarbeitung des Bohrloches NR 2 das Werkzeug zu wechseln  und  um gegebenenfalls, bei  &Auml;nderung der
Werkzeugl&auml;nge, einen neuen Werkst&uuml;cknullpunkt einzustellen zu k&ouml;nnen.</font></p>
<p><font face="Tahoma" size="2"><font color="#FF00FF"><b>1.9</b> Vorschub</font><br>
  Die Angabe der Vorschubgeschwindigkeit erfolgt in derselben Einheit wie bei 
  der Software <i><b>nc</b></i>; also "50" bedeutet, dass die CNC-Maschine das 
  betr. Zeichnungsteil mit der Geschwindigkeit "F50" abf&auml;hrt. Es d&uuml;rfen 
  nur ganze Zahlen zwischen 1 und 250 ( 1 bis 200 bei CNC-Maschinen der Version1) 
  eingegeben werden. Wird sie bei einem Zeichnungsteil nicht angegeben, gilt die 
  Vorgabe VG=5.</font></p>
<p><font face="Tahoma" size="2"><font color="#FF00FF"><b>1.10</b> Werkzeugdurchmesser</font><br>
F&uuml;r die Berechnung von Bahnen ist der Durchmesser des verwendeten Werkzeuges (z.B. Fr&auml;ser) anzugeben.  Diese Angabe muss an der ersten Zuordnung stehen, an der sie  ben&ouml;tigt wird und bleibt f&uuml;r alle
Zeichnungsteile g&uuml;ltig, wenn sie nicht erneuert  wird.</font></p>
<p><font face="Tahoma" size="2"><font color="#FF00FF"><b>1.11</b> Gesamttiefe/Teilzustellung/1.Stufe</font><br>
  Bei einfachen Zeichnungsteilen gen&uuml;gt die Angabe der Gesamttiefe. Bei zu 
  groﬂer Gesamttiefe darf jedoch nicht auf einmal zugestellt werden. In diesen 
  F&auml;llen ist eine technologisch sinnvolle Angabe im Feld "Teilzustellung" 
  zu machen. Die Gesamtzustellung (g) wird dann durch mehrmaliges Zustellen (e) 
  erreicht. Bei Bohrungen (Punkten) wird in diesem Fall ein "Tiefbohrzyklus" gefahren, 
  d.h. der Bohrer wird mehrmals aus- und eingefahren. Bei Bohrungen mit Senkung 
  muss eine Angabe im Feld "Tiefe 1.Stufe" (s) angegeben werden. Diese Angabe 
  ist nur wirksam, wenn im Feld "Bearbeitung" "Stufenbohrung" gew&auml;hlt wird. 
  (siehe Bild). <br>
  VORSICHT: Vorschubgeschwindigkeit und Teilzustellung m&uuml;ssen unbedingt an 
  das Material des verwendeten Werkst&uuml;cks angepasst werden.</font></p>
<p><font face="Tahoma" size="2"><font color="#FF00FF"><b>1.12</b> Taschenrand</font><br>
Im Zusammenhang mit Stufenbohrungen (Kreis, Langloch) und Sackloch (Kreis, Langloch, Rechteck) kann ein "Taschenrand" vorgegeben werden.  Beim Ausfr&auml;sen wird der letzte Fr&auml;svorgang f&uuml;r die fertige Kontur mit dem hier angegebenen
Maﬂ gemacht. Bei geeigneter Angabe (z.B. 0.1mm) entspricht dies einem "Schlichtvorgang" - besondere
Maﬂgenauigkeit und Oberfl&auml;cheng&uuml;te sind die Folge.</font></p>
<p><font face="Tahoma" size="2"><font color="#FF00FF"><b>1.13</b> Werkst&uuml;ck-Nullpunkt verschieben</font><br>
Bei stufigen K&ouml;rpern muss der CNC-Maschine gesagt werden, in welcher H&ouml;he das Zeichnungsteil
entstehen soll. Dies geschieht mit der Angabe im Feld "Z-Nullpunkt
verschieben&quot;, die im Grunde den Werkst&uuml;cknullpunkt in der Z-Ebene  um  x   mm  nach  oben- oder unten verstellt.  Die Angabe  bezieht  sich
automatisch  auf  die  h&ouml;chste  bearbeitete Ebene. Am Ende der Bearbeitung wird die Referenz-Oberfl&auml;che wieder auf den urspr&uuml;nglichen Wert zur&uuml;ckgesetzt. Siehe Beispiel-Datei
ZRDEMO.</font></p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p><font face="Tahoma" size="2"><img src="Bilder/Techno_Steuerung.gif" width="438" height="533"><br>
  </font><b><font color="#FF00FF" face="Tahoma" size="5">2.</font><font face="Tahoma" size="2" color="#FF00FF"> 
  Technologie-Angaben, Karteikarte &quot;Steuerung&quot;</font></b></p>
<p><font face="Tahoma" size="2"><font color="#FF00FF"><b>2.1</b> Fr&auml;srichtung</font><br>
  Dies kann dann von Bedeutung sein, wenn die Bewegung der Fr&auml;ser-Schneide 
  im Werkst&uuml;ck bestimmt werden muss. Eingestellt werden kann: Fr&auml;srichtung 
  im Uhrzeigersinn = Vorgabe, wenn keine Angabe gemacht wird. Fr&auml;srichtung 
  entgegen dem Uhrzeigersinn.</font></p>
<p><font face="Tahoma" size="2"><font color="#FF00FF"><b>2.2</b> Spannung</font><br>
  Abh&auml;ngig vom verwendeten Interface der CNC-Maschine kann eine programmierbare 
  Spannung ausgegeben werden, die f&uuml;r Automatisierungs-Aufgaben, wie z.B. 
  Steuerung einer Spindel-Drehzahl, benutzt wird. Bitte beachten: Das Ausgeben 
  von Spannung mu&szlig; in vielen F&auml;llen mit einer &quot;Pause vorher&quot; 
  kombiniert werden, damit die Wirkung der Spannung , wie z.B. Hochfahren der 
  Spindeldrehzahl, entstehen kann.</font></p>
<p><font face="Tahoma" size="2">N&auml;here Hinweise siehe <a href="../Automation/Automation.htm">Automation</a> 
  und <a href="Anschlussbelegung.htm">Anschlussbelegung</a>.</font></p>
<p><font face="Tahoma" size="2"><font color="#FF00FF"><b>2.3</b> Pause vorher/nachher</font><br>
Die TIMER-Funktion der CNC-Maschine bzw. des PCs sollen auch innerhalb der Technologie-Angaben genutzt werden k&ouml;nnen. Deshalb wurde die folgende Funktion eingef&uuml;hrt. Es wird eine entsprechende Wartezeit eingebaut, bevor die n&auml;chste T&auml;tigkeit gestartet wird. Die kann sinnvoll sein, um "vorher" eine Fr&auml;smaschine hochlaufen zu lassen oder um "nachher" eine Abk&uuml;hlphase
einzuf&uuml;gen u.&Auml;.m.   Pause vorher		mit Pausenzeit  t  in 1/18 sek.  Pause nachher	mit Pausenzeit  t  in 1/18 sek.  Die Ausdrucksweise "vorher" oder "nachher" bezieht sich auf die Ausf&uuml;hrung der Schaltfunktion "bevor" das zugeh&ouml;rige Zeichnungsteil abgearbeitet wird oder "nachdem" das zugeh&ouml;rige Zeichnungsteil  abgearbeitet  wurde.</font></p>
<p><font face="Tahoma" size="2"><font color="#FF00FF"><b>2.4 </b>Eingangsabfrage 
  vorher/nachher</font><br>
  Das Interface verf&uuml;gt &uuml;ber 5 Digitale Eing&auml;nge, die in Bearbeitungs-Systemen 
  frei genutzt werden k&ouml;nnen (Sicherheitsabfragen, Quittungs-Schalter, Synchronisation 
  mit anderen Automatisierungs-Teilen u.&Auml;.m.). Die Eing&auml;nge 1 bis 5 
  sind von links nach rechts symbolisch dargestellt. Klicken Sie einen Kreis an, 
  wird der Innenraum markiert. F&uuml;r das Verst&auml;ndnis hilft folgender Satz: 
  Die CNC-Maschine wartet vor oder nach der Bearbeitung des zugeordneten Zeichnungsteils 
  solange, bis der markierte Eingang offen oder geschlossen ist. Offen heiﬂt keine 
  Masseverbindung des markierten Eingangs, geschlossen heiﬂt Masseverbindung. 
  Die Anschl&uuml;sse der freien Eing&auml;nge finden Sie im Anhang unter <a href="Anschlussbelegung.htm">Anschlussbelegung</a>.</font></p>
<p>&nbsp;</p>
<p><b><font color="#FF00FF" face="Tahoma" size="5">3.</font><font face="Tahoma" size="2" color="#FF00FF"> 
  Technologie-Angaben, Karteikarte &quot;Punkt/Bahn-Dosierung&quot;</font></b><font face="Tahoma" size="2" color="#000000"><br>
  Diese Technologie-Angaben geh&ouml;ren zu einer besonderen Anwendung und werden 
  unter <a href="../Grundlagen_Dosiersystem/Dosieren.htm">Spezialanwendungen/Automation/Dosieren</a> 
  ausf&uuml;hrlich behandelt. </font></p>
<p>&nbsp;</p>
<p><b><font color="#FF00FF" face="Tahoma" size="5">4.</font><font face="Tahoma" size="2" color="#FF00FF"> 
  Technologie-Angaben, Karteikarte &quot;Mindermengendosierung&quot;</font></b><font face="Tahoma" size="2" color="#000000"><br>
  Diese Technologie-Angaben geh&ouml;ren zu einer Spezialanwendung und werden 
  unter <a href="../Optionen%20Anwendung/Mindermengendosierung.htm">Optionen/Mindermengendosierung</a> 
  ausf&uuml;hrlich behandelt. </font></p>
<p>&nbsp;</p>
<p><b><font color="#FF00FF" face="Tahoma" size="5">5.</font><font face="Tahoma" size="2" color="#FF00FF"> 
  Technologie-Angaben, besondere Karteikarten</font></b><font face="Tahoma" size="2" color="#000000"><br>
  Es gibt Anwendungen, wie z.B. 3D-Fr&auml;sen oder Drehen, dei besondere Technologie-Angaben 
  erforderlich machen. In diesen F&auml;llen erschent ein spezielles Technologie-Fenster 
  mit separaten Karteikarten, die im Zusammenhang mit den Anwendungen n&auml;her 
  erkl&auml;rt werden.</font></p>
</body>

</html>
